# ElementArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArrayIterator Class
Members See Also
---
An iterator to an element array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ElementArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ElementArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ElementArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ElementArrayIterator
# See Also
ElementArrayIterator Members
Autodesk.Revit.DB Namespace